<?php

/**
 * @author bluelovers
 * @copyright 2012
 */

class Sco_Text_Helper
{

	public static $map_h2f;

	public static function str2hex($string)
	{
		$hex = '';
		for ($i = 0; $i < strlen($string); $i++)
		{
			$hex .= dechex(ord($string[$i]));
		}
		return $hex;
	}

	public static function hex2str($hex)
	{
		$string = '';
		for ($i = 0; $i < strlen($hex) - 1; $i += 2)
		{
			$string .= chr(hexdec($hex[$i] . $hex[$i + 1]));
		}
		return $string;
	}

	function str_f2h($str, $h2f = false)
	{
		if (!isset(self::$map_h2f))
		{
			self::$map_h2f = array(
				' ' => '　',
				'0' => '０',
				'1' => '１',
				'2' => '２',
				'3' => '３',
				'4' => '４',
				'5' => '５',
				'6' => '６',
				'7' => '７',
				'8' => '８',
				'9' => '９',
				'A' => 'Ａ',
				'B' => 'Ｂ',
				'C' => 'Ｃ',
				'D' => 'Ｄ',
				'E' => 'Ｅ',
				'F' => 'Ｆ',
				'G' => 'Ｇ',
				'H' => 'Ｈ',
				'I' => 'Ｉ',
				'J' => 'Ｊ',
				'K' => 'Ｋ',
				'L' => 'Ｌ',
				'M' => 'Ｍ',
				'N' => 'Ｎ',
				'O' => 'Ｏ',
				'P' => 'Ｐ',
				'Q' => 'Ｑ',
				'R' => 'Ｒ',
				'S' => 'Ｓ',
				'T' => 'Ｔ',
				'U' => 'Ｕ',
				'V' => 'Ｖ',
				'W' => 'Ｗ',
				'X' => 'Ｘ',
				'Y' => 'Ｙ',
				'Z' => 'Ｚ',
				'a' => 'ａ',
				'b' => 'ｂ',
				'c' => 'ｃ',
				'd' => 'ｄ',
				'e' => 'ｅ',
				'f' => 'ｆ',
				'g' => 'ｇ',
				'h' => 'ｈ',
				'i' => 'ｉ',
				'j' => 'ｊ',
				'k' => 'ｋ',
				'l' => 'ｌ',
				'm' => 'ｍ',
				'n' => 'ｎ',
				'o' => 'ｏ',
				'p' => 'ｐ',
				'q' => 'ｑ',
				'r' => 'ｒ',
				's' => 'ｓ',
				't' => 'ｔ',
				'u' => 'ｕ',
				'v' => 'ｖ',
				'w' => 'ｗ',
				'x' => 'ｘ',
				'y' => 'ｙ',
				'z' => 'ｚ',
				'~' => '～',
				'!' => '！',
				'@' => '＠',
				'#' => '＃',
				'$' => '＄',
				'%' => '％',
				'^' => '︿',
				'&' => '＆',
				'*' => '＊',
				'(' => '（',
				')' => '）',
				'_' => '＿',
				'+' => '＋',
				'|' => '｜',
				'`' => '‘',
				'-' => '－',
				'=' => '＝',
				'\\' => '＼',
				'{' => '｛',
				'}' => '｝',
				'[' => '〔',
				']' => '〕',
				':' => '：',
				'"' => '”',
				';' => '；',
				'\'' => '’',
				'<' => '＜',
				'>' => '＞',
				'?' => '？',
				',' => '，',
				'.' => '．',
				'/' => '／',
				);
		}

		return $h2f ? strtr((string)$str, self::$map_h2f) : strtr((string)$str, array_flip(self::$map_h2f));
	}

}
